# -*- coding: utf-8 -*-
'''
Data for tests
'''

QUOTE_FROM_ILF_AND_PETROV = \
u'''
Люди еще спали, но река  жила,  как  днем.  Шли  плоты  --
огромные поля бревен с избами на них. Маленький злой буксир, на
колесном  кожухе  которого  дугой  было  выписано  его  имя  --
"Повелитель бурь", тащил за собой три нефтяные баржи, связанные
в  ряд.  Пробежал  снизу  быстрый  почтовик  "Красная  Латвия".
"Скрябин" обогнал землечерпательный караван и, промеряя глубину
полосатеньким  шестом,  стал описывать дугу, заворачивая против
течения.
     На  пароходе  стали  просыпаться.  На  пристань  "Бармино"
полетела   гирька   со  шпагатом.  На  этой  леске  пристанские
притащили  к  себе  толстый  конец  причального  каната.  Винты
завертелись  в  обратную  сторону. Полреки облилось шевелящейся
пеной. "Скрябин" задрожал от резких ударов винта и  всем  боком
пристал  к  дебаркадеру.  Было  еще  рано. Поэтому тираж решили
начать в десять часов.
     Служба на "Скрябине" начиналась,  словно  бы  и  на  суше,
аккуратно  в  девять. Никто не изменил своих привычек. Тот, кто
на суше опаздывал на службу, опаздывал и  здесь,  хотя  спал  в
самом  же учреждении. К новому укладу походные штаты Наркомфина
привыкли  довольно  быстро.  Курьеры  подметали  каюты  с   тем
равнодушием,  с  каким  подметали канцелярии в Москве. Уборщицы
разносили чай, бегали с  бумажками  из  регистратуры  в  личный
стол,  ничуть  не удивляясь тому, что личный стол помещается на
корме, а регистратура на носу. Из каюты взаимных расчетов несся
кастаньетный  звук  счетов  и  скрежетанье  арифмометра.  Перед
капитанской рубкой кого-то распекали.
     Великий комбинатор, обжигая босые ступни о верхнюю палубу,
ходил  вокруг длинной узкой полосы кумача, малюя на ней лозунг,
с текстом которого он поминутно сверялся по бумажке:
     "Все -- на тираж! Каждый трудящийся должен иметь в кармане
облигацию госзайма".
     Великий   комбинатор   очень   старался,   но   отсутствие
способностей  все-таки  сказывалось.  Надпись  поползла вниз, и
кусок кумача, казалось, был испорчен безнадежно. Тогда Остап, с
помощью мальчика Кисы  перевернул  дорожку  наизнанку  и  снова
принялся  малевать.  Теперь  он  стал  осторожнее.  Прежде  чем
наляпывать  буквы,   он   отбил   вымеленной   веревочкой   две
параллельных  линии  и,  тихо  ругая неповинного Воробьянинова,
приступил к изображению слов.
     Ипполит  Матвеевич  добросовестно   выполнял   обязанности
мальчика.  Он  сбегал  вниз за горячей водой, растапливал клей,
чихая, сыпал в ведерко краски и  угодливо  заглядывал  в  глаза
взыскательного   художника.   Готовый   и   высушенный   лозунг
концессионеры снесли вниз и прикрепили к борту.
     Толстячок, нанявший  Остапа,  сбежал  на  берег  и  оттуда
смотрел  работу  нового  художника.  Буквы  лозунга были разной
толщины и несколько  скошены  в  стороны.  Выхода,  однако,  не
было-приходилось довольствоваться и этим.
     На   берег  сошел  духовой  оркестр  и  принялся  выдувать
горячительные марши. На звуки музыки со всего Бармина сбежались
дети, а за ними из яблоневых садов  двинулись  мужики  и  бабы.
Оркестр  гремел  до  тех  пор,  покуда  на берег не сошли члены
тиражной комиссии. Начался митинг. С крыльца  чайной  Коробкова
полились первые звуки доклада о международном положении.
     Колумбовцы  глазели  на  собрание с парохода. Оттуда видны
были белые платочки баб, опасливо стоявших поодаль от  крыльца,
недвижимая  толпа  мужиков,  слушавших  оратора,  и сам оратор,
время от времени взмахивавший руками.  Потом  заиграла  музыка.
Оркестр повернулся и, не переставая играть, двинулся к сходням.
За ним повалила толпа.
     Тиражный  аппарат  методически выбрасывал комбинации цифр.
Колеса оборачивались, оглашались номера,  барминцы  смотрели  и
слушали.
     Прибежал   на  минуту  Остап,  убедился  в  том,  что  все
обитатели парохода сидят в тиражном зале,  и  снова  убежал  на
палубу.
     -- Воробьянинов,-шепнул   он,-для   вас  срочное  дело  по
художественной части. Встаньте у  выхода  из  коридора  первого
класса  и  стойте.  Если  кто  будет  подходить-пойте погромче.
Старик опешил.
     -- Что же мне петь?
     -- Уж во всяком случае не "боже, царя храни!".  Что-нибудь
страстное:  "Яблочко"  или "Сердце красавицы". Но предупреждаю,
если вы вовремя не  вступите  со  своей  арией!..  Это  вам  не
Экспериментальный театр! Голову оторву.
     Великий  комбинатор, пришлепывая босыми пятками, выбежал в
коридор, обшитый вишневыми панелями. 
'''.lower()